[
    {
        "title": "Introduction",
        "content": "This is the place for me to reflect. This isn't just a normal, so-called, blog channel or website. It's for people like me who have dreams, big dreams, but don't have the audacity to do something good with their lives. I know how hard and frustrating it could be when you actually dream to do something big but just cannot. That late night motivation that I'll start tomorrow is never gonna come true. Trust me. You're not alone. I'm the same person as like you, and I can promise there're millions like us. Stop feeling yourself as a looser. \n\nWe are not the problem, but if we don't take any measure we'll forever be trapped in the rat race. This middle-class life is shit. Trust me. You may be wondering who's this fucking anonymous writer lecturing us? I'm nothing, and yes, who am I to lecture you? I'm not lecturing. I'm sharing what I have learnt, and what I'll do to make my life better. Becoming even 1% better is true. It won't cost you a million dollars to wake a bit early, read some pages of a non-fiction book, talk to a neighbor or a cashier in a friendly tone, go for a run, or even just posting about your experience. \n\nThere's so much to do, but we're trapped. I'm not gonna be. I promise. I can't swear how much time it's gonna take, what I'll do, or even if I would even make it to the top 5%(not a goal, yeah. It never was.) Making money shouldn't be the end goal. I mean it. The inner satisfaction you get when you see yourself enjoying the phase, waking early, never missing a workout, or a Duolingo lesson. That's real happiness. I'm not gonna bore you guys with a ton of nonsense. But yes, trust me, I can show you how a guy like me, with no special talent is gonna reform, and perform!",
        "date": "December 30, 2025"
    },
    {
        "title": "Welcome",
        "date": "September 30, 2025",
        "content": "This is the beginning of my public journal."
    }
]

[
    {
        "title": "Seeking the path to succeed",
        "content": "This might sound a bit strange, maybe more than that when I promised I'll reform and perform. The journey isn't easy nor the path I have taken. How do I even begin? Yes, I'm confused, and yeah, my life is fucked up. Seriously.\n\nThe motivation strikes hard. But, it cannot beat discipline. I have tried this, and I'm exhausted. Let the journey begin(it has?, yeah), and we'll see how good I can perform. At every sector. Nor at something specific. Becoming a all-rounder is a must, now, and forever. Loosing isn't a choice anymore. Either in career or relationship. Well, I don't have either at the moment but unlike most trapped rats, I'm not gonna waste my energy on admiring a girl or just sitting, and dreaming. Now, it feels more than a dream: an obligation. I wouldn't be trapped. A routine is a must. Discipline is a must. And, with the new-year coming, I take some challenges onto myself.\n\nThis year won't be a roller-coaster. I'll live by my rules.",
        "date": "December 31, 2025"
    }
]

